NextFOAM-2407/tutorials/multiphase/overInterDyMFoam/floatingBodyWithSpring/background/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    stationaryWalls
    {
        type            calculated;
        value           uniform 0;
    }

    "(atmosphere|sidePatch)"
    {
        type            calculated;
        value           uniform 0;
    }

    floatingObject
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    overset
    {
        patchType       overset;
        type            zeroGradient;
    }

    oversetPatch
    {
        type            overset;
    }
}


// ************************************************************************* //
